#+STARTUP: show2levels

これだけは絶対に必要！と思える設定。

** C-hをBSにする[C-h]

- [[https://www.emacswiki.org/emacs/BackspaceKey][[Home] Backspace Key]]
  - 記述が間違っている
- [[http://malkalech.com/emacs_c-h_backspace][EmacsのC-hでBackspaceするのに紆余曲折したことのメモ | Jenemal Notes]]

#+begin_src emacs-lisp
  (define-key key-translation-map [?\C-h] [?\C-?])
#+end_src

#+RESULTS:
: [127]

- 次の方法だとpereditでうまくいかない

#+begin_example
  (leaf *backspace
    :init (global-set-key (kbd "C-^") help-map)
    :bind (("C-h" . delete-backward-char)))
#+end_src

*** Mozcサーバと通信するためのヘルパーコマンドの設定
Mozcとのやり取りをするためのヘルパーを設定します。
WSL環境では、mozc_emacs_helper.exeに置き換えると、Windows側のGoogle IMEが使えます（後述のWindows用設定が必要）。

+ [[https://w.atwiki.jp/ntemacs/pages/50.html][emacs-mozc を動かすための設定（mozc_emacs_helper コンパイル編） - NTEmacs @ ウィキ - atwiki（アットウィキ）]]
+ [[https://w.atwiki.jp/ntemacs/pages/61.html][emacs-mozc を動かすための設定（WSL 設定編） - NTEmacs @ ウィキ - atwiki（アットウィキ）]]

#+NAME: mozc-helper
#+begin_src emacs-lisp :tangle no
  (cond ((eq system-type 'windows-nt)
      (setq mozc-helper-program-name "~/Dropbox/bin/mozc_emacs_helper.exe"))
      (t (setq mozc-helper-program-name "mozc_emacs_helper")))
  ;; (if (getenv "WSLENV")
  ;;     ;; (setq mozc-helper-program-name "mozc_emacs_helper_win.sh")
  ;;     (setq mozc-helper-program-name "mozc_emacs_helper")
  ;;   (setq mozc-helper-program-name "mozc_emacs_helper"))
#+end_src

#+RESULTS: mozc-helper
: ~/Dropbox/bin/mozc_emacs_helper.exe

